Revit 2024 API
RebarFreeFormAccessor.WorkshopInstructions Property
 Identifies the workshop instructions of the current Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public RebarWorkInstructions WorkshopInstructions { get; set; }
Visual Basic
Public Property WorkshopInstructions As RebarWorkInstructions
	Get
	Set
Visual C++
public:
property RebarWorkInstructions WorkshopInstructions {
	RebarWorkInstructions get ();
	void set (RebarWorkInstructions value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace